org/20231125T212326--denote-features__emacs.org
#+title:      denote features
#+date:       [2023-11-25 Sat 21:23]
#+filetags:   :emacs:
#+identifier: 20231125T212326

[[file:20231125T211812--why-i-use-denote__emacs.org][Why I use Denote.]]

* Some features not to forget.

- Rename the files(denote-rename)
- Take pdf or any other file, rename it denote style - search for it later
- remove/add keywords
- quickly create notes
- modify the font matter to your liking
- use m% to search for notes with regular expressions

#+begin_src bash
  U - unmark all selections in dired

  %m

  t - toggle the mark
  k - kill unecessary
  g - close this
  v - view file quick
  q - quit
#+end_src

- have a list of "backlinks" that link to your current note
