html/20231125T212326--denote-features__emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-20 Wed 08:23 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>denote features</title>
<meta name="author" content="Arvydas Gasparavicius" />
<meta name="description" content="welcome to my site" />
<meta name="keywords" content="emacs antanas geles" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../static/css/org-html-style-default.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/generic.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/taingram.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/lightbox.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/scroll-to-top.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sitemap.html">NOTES </a>
 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="preamble" class="status">
<div id="updated">Updated: 2023-12-14 Thu 19:02</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">denote features</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org009430d">1. Some features not to forget.</a></li>
</ul>
</div>
</nav>
<p>
<a href="20231125T211812--why-i-use-denote__emacs.html">Why I use Denote.</a>
</p>

<div id="outline-container-org009430d" class="outline-2">
<h2 id="org009430d"><span class="section-number-2">1.</span> Some features not to forget.</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Rename the files(denote-rename)</li>
<li>Take pdf or any other file, rename it denote style - search for it later</li>
<li>remove/add keywords</li>
<li>quickly create notes</li>
<li>modify the font matter to your liking</li>
<li>use m% to search for notes with regular expressions</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">U - unmark all selections in dired

%m

t - toggle the mark
k - kill unecessary
g - close this
v - view file quick
q - quit
</pre>
</div>

<ul class="org-ul">
<li>have a list of "backlinks" that link to your current note</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr/>
	 <footer>
	 <div class="copyright-container">
	 <div class="copyright">
	 Copyright &copy; 2023-2023 Arvydas Gasparavicius
	 </div>
	 </div>
	 <p class="date">This org file is created: 2023-11-25 Sat 21:23</p>
	 <p class="date">This org file is last modified: 2023-12-14 Thu 19:02</p>
	 <p class="date">This org file is exported to HTML: 2023-12-20 Wed 08:23</p>
	 <div class="generated">
	Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6) on <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a>
	</div>
	</footer>
	 <button onclick="topFunction()" id="myBtn" title="Go to top">Top</button>
	 <script src="../static/js/generic.js"></script>
	 <script src="../static/js/scroll-to-top.js"></script>
	 <script src="../static/js/lightbox.js"></script>
</div>
</body>
</html>